import numpy as np

# Дві матриці 2×3
A = np.array([[1, 2, 3],
              [4, 5, 6]])

B = np.array([[7, 8, 9],
              [10, 11, 12]])

print("Матриця A:")
print(A)
print("Матриця B:")
print(B)

# Додавання
C = A + B
print("A + B:")
print(C)

# Віднімання
D = A - B
print("A - B:")
print(D)

# Множення на скаляр
E = 3 * A
print("3 × A:")
print(E)

# Комбінована операція
F = 2*A + 3*B
print("2×A + 3×B:")
print(F)



# Матриця A:
# [[1 2 3]
#  [4 5 6]]

# Матриця B:
# [[ 7  8  9]
#  [10 11 12]]

# A + B:
# [[ 8 10 12]
#  [14 16 18]]

# A - B:
# [[-6 -6 -6]
#  [-6 -6 -6]]

# 3 × A:
# [[ 3  6  9]
#  [12 15 18]]

# 2×A + 3×B:
# [[23 28 33]
#  [38 43 48]]
