# ## Задача: Проєкція вектора на площину xy

# ### Дано
# v = [2, 3, 5]

# ### Потрібно
# 1) Спроектувати вектор `v` на площину `xy`.  

# 2) Визначити перпендикулярну частину (компоненту), 
# яка відкидається при проєкції.  

# 3) Відповісти на питання: чому перпендикулярна частина 
# має координати лише по осі `z`?


import numpy as np

v = np.array([2, 3, 5])
n = np.array([0, 0, 1])  # нормаль до площини xy

# перпендикулярна складова (проєкція на нормаль)
v_perp = ((v @ n) / (n @ n)) * n

# проєкція на площину (відкидаємо перпендикулярну складову)
v_xy = v - v_perp

print(f"v = {v}")
print(f"n = {n}")
print(f"Перпендикулярна частина v_perp = {v_perp}")
print(f"Проєкція на площину xy (v_xy) = {v_xy}")


# v = [2 3 5]
# n = [0 0 1]
# Перпендикулярна частина v_perp = [0. 0. 5.]
# Проєкція на площину xy (v_xy) = [2. 3. 0.]


### Відповідь на питання

# Нормаль до площини `xy` — це n = [0, 0, 1], 
# тобто напрям уздовж осі `z`.
# Проєкція на n завжди кратна n, тому має вигляд [0, 0, α].

# Для нашого випадку α = 5, тож v⊥ = [0, 0, 5].
