# ## Задача 5: Угол между векторами

# ### Дано
# u = [3, 4]  
# v = [4, 3]

# ### Нужно
# 1) Найти угол между векторами `u` и `v`.  
# 2) Ответить на вопрос: как изменится угол, если оба вектора умножить на 2?


import numpy as np

u1 = np.array([3, 4])
v1 = np.array([4, 3])

angle1 = np.arccos((u1 @ v1) / (np.linalg.norm(u1) * np.linalg.norm(v1)))
print(f"  u = {u1}, v = {v1}")
print(f"  Кут: {np.degrees(angle1):.2f} градусів")

#   u = [3 4], v = [4 3]
#   Кут: 16.26 градусів


# Відповідь на питання: якщо обидва вектори подвоїти, кут не зміниться, 
# бо множення на скаляр змінює лише довжину, а не напрямок.