# ## Задача 2: Длина и нормализация вектора

# ### Дано
# w = [1, -2, 2, -1]

# ### Нужно
# 1) Найти длину (евклидову норму) вектора `w`.
# 2) Нормализовать `w`.
# 3) Проверить, что норма нормализованного вектора равна 1.
# 4) Ответить на вопрос: почему нормализация не изменяет направление вектора?



import numpy as np

# вектор
w = np.array([1, -2, 2, -1])
norm_w = np.linalg.norm(w)
print(f"Вектор w = {w}")
print(f"Норма ||w|| = {norm_w:.2f}")

# Нормалізація
w_normalized = w / np.linalg.norm(w)
print(f"Нормалізований вектор: w = {w_normalized}")
print(f"Норма нормалізованого: ||w|| = {np.linalg.norm(w_normalized)}")

# Перевірка: нормалізований вектор має норму 1
print(f"Норма дорівнює 1? {np.isclose(np.linalg.norm(w_normalized), 1.0)}")


# Нормалізація не змінює напрямок вектора, тому що вона лише масштабує його на 
# додатне число.
# Ми ділимо вектор w на його довжину ||w||, тобто множимо на 1/||w|| > 0:
# ŵ = w / ||w||.
# Множення вектора на додатний скаляр змінює тільки довжину (модуль), 
# але не напрямок — вектор залишається на тій самій прямій (у тому самому напрямку) 
# відносно початку координат.

