# ## Задача: Векторное произведение и перпендикулярность

# ### Дано
# u = [1, 0, 0]  
# v = [0, 1, 0]

# ### Нужно
# 1) Найти векторное произведение `u × v`.  
# 2) Проверить, что полученный вектор перпендикулярен к `u` и к `v`.  
# 3) Ответить на вопрос: в каком направлении направлен полученный вектор?

import numpy as np

# Вектори
u = np.array([1, 0, 0])
v = np.array([0, 1, 0])

# Через NumPy
w = np.cross(u, v)

print(f"Вектор u: {u}")
print(f"Вектор v: {v}")
print(f"Векторний добуток (NumPy): {w}")

# Перевірка ортогональності
print(f"Ортогональність:")
print(f"  u · (u×v) = {u @ w} -> {(u @ w) == 0}")
print(f"  v · (u×v) = {v @ w} -> {(v @ w) == 0}")

# Вектор u: [1 0 0]
# Вектор v: [0 1 0]
# Векторний добуток (NumPy): [0 0 1]
# Ортогональність:
#   u · (u×v) = 0 -> True
#   v · (u×v) = 0 -> True


# ### Відповідь на питання
# Напрямок буде уздовж додатної осі **z** (правило правої руки).

# Довжина:
# |u × v| = |u| · |v| · sin(θ) = 1 · 1 · 1 = 1
