# ## Задача 12

# ### Дано (в R^4)
# a1 = [1, 0, 0, 1]  
# a2 = [0, 1, 1, 0]  
# a3 = [1, 1, 1, 1]

# ### Потрібно
# 1) Побудувати матрицю `A`, використовуючи вектори `a1`, `a2`, `a3` як рядки.  
# 2) Знайти ранг матриці `A`.  
# 3) Відповісти на питання:
#    - яку розмірність має підпростір, породжений цими векторами;
#    - чи утворюють ці вектори базис у R^4.


import numpy as np

# Дано (в R^4)
a1 = np.array([1, 0, 0, 1])
a2 = np.array([0, 1, 1, 0])
a3 = np.array([1, 1, 1, 1])

# 1) Матриця A: вектори як РЯДКИ
A = np.array([a1, a2, a3])

print("Матриця A (рядки = a1, a2, a3):")
print(A)
print(f"Розмірність A: {A.shape[0]}×{A.shape[1]}")

# 2) Ранг матриці A
rank_A = np.linalg.matrix_rank(A)
print(f"rank(A) = {rank_A}")

# 3) Висновки
print("Висновки:")
print(f"- Підпростір, породжений цими векторами, має розмірність {rank_A}.")

if rank_A == 4:
    print("- Вектори утворюють базис у R^4 (бо є 4 лінійно незалежні вектори).")
else:
    print("- Вектори НЕ утворюють базис у R^4, бо їх лише 3, і rank(A) < 4.")
