# ## Задача 3: Расстояние между точками и длина вектора

# ### Дано
# A = (1, 2, 3)  
# B = (4, 6, 3)

# ### Нужно
# 1) Найти расстояние между точками A и B.  
# 2) Найти длину вектора (B − A).  
# 3) Ответить на вопрос: всегда ли расстояние между точками совпадает с длиной вектора, который их соединяет?


import numpy as np

# Дві точки на площині (координати)
A = np.array([1, 2, 3])
B = np.array([4, 6, 3])

# Відстань = норма вектора різниці
diff = B - A

print(f"Точка A: {A}", f"Точка B: {B}")
print(f"Вектор B - A: {B - A}")

# Різні відстані
d_L2 = np.linalg.norm(diff, ord=2)
d_L1 = np.linalg.norm(diff, ord=1)
d_Linf = np.linalg.norm(diff, ord=np.inf)

print(f"Евклідова відстань: {d_L2:.2f}")
print(f"Мангеттенська відстань: {d_L1:.2f}")
print(f"Чебишова відстань: {d_Linf:.2f}")


# Точка A: [1 2 3] Точка B: [4 6 3]
# Вектор B - A: [3 4 0]
# Евклідова відстань: 5.00
# Мангеттенська відстань: 7.00
# Чебишова відстань: 4.00


# Так, якщо відстань визначено через норму різниці точок.
# Тоді вектор, що з’єднує точки, дорівнює (B − A), а відстань:
# d(A, B) = ||B − A||.

# Це працює для будь-якої норми (L2, L1, L∞), 
# якщо саме її використовують як метрику.

# Не завжди збігається лише тоді, коли “відстань” визначають 
# інакше (наприклад, по дорогах/графу або як геодезичну 
# відстань на поверхні), тобто не як норму вектора (B − A).
