# Задача 4. У просторі задано три точки:
# A(1, 2, 1), B(3, 5, 2), C(5, 8, 3).

# Порівняйте відстані AB, BC, AC.
# Що можна сказати про розташування точок?

import numpy as np

A = np.array([1,2,1])
B = np.array([3,5,2])
C = np.array([5,8,3])

AB = np.linalg.norm(B - A)
BC = np.linalg.norm(C - B)
AC = np.linalg.norm(C - A)

print("AB:", AB)
print("BC:", BC)
print("AC:", AC)

# AB: 3.7416573867739413
# BC: 3.7416573867739413
# AC: 7.483314773547883

# Точки A, B і C лежать на одній прямій (колінеарні).
# Оскільки AB = BC, точка B знаходиться між A та C і є серединою відрізка AC.
# Також AC = AB + BC (тобто AC = 2·AB).
