# ## Задача 6: Скалярное произведение и косинусная схожесть

# ### Дано
# a = [1, 0, 1]  
# b = [-1, 0, 1]

# ### Нужно
# 1) Найти скалярное произведение векторов `a` и `b`.  
# 2) Найти косинусную схожесть между `a` и `b`.  
# 3) Ответить на вопрос: почему косинусная схожесть может быть отрицательной?


import numpy as np

a = np.array([1, 0, 1])
b = np.array([-1, 0, 1])

# Скалярний добуток
dot_product = a @ b
norm_a = np.linalg.norm(a)
norm_b = np.linalg.norm(b)


# Косинус кута
cos_theta = dot_product / (norm_a * norm_b)

print(f"Скалярний добуток a·b: {dot_product}")
print(f"cos(θ) = {cos_theta:.4f}")

# Скалярний добуток a·b: 0
# cos(θ) = 0.0000


# Відповідь на питання: косинусна схожість може бути негативною, 
# якщо кут між векторами більший за 90°, 
# тобто вони спрямовані у протилежні сторони.