# ## Задача 11: Лінійна комбінація та підпростір

# ### Дано
# v1 = [1, 2, 0]  
# v2 = [0, 1, 1]  
# v3 = [1, 3, 1]

# ### Потрібно
# 1) Перевірити, чи можна записати вектор `v3` як лінійну комбінацію 
# векторів `v1` і `v2`, тобто чи існують числа `a` і `b`, такі що:
# a*v1 + b*v2 = v3

# 2) Відповісти на питання: якщо так, що це означає для підпростору, 
# який вони породжують?

import numpy as np

# Дано (в R^3)
v1 = np.array([1, 2, 0])
v2 = np.array([0, 1, 1])
v3 = np.array([1, 3, 1])

print("Вектори:")
print(f"  v1 = {v1}")
print(f"  v2 = {v2}")
print(f"  v3 = {v3}")

# 1) Перевірка: чи лежить v3 у span(v1, v2)?
# Порівнюємо ранги: rank([v1, v2]) і rank([v1, v2, v3])
A12  = np.column_stack([v1, v2])
A123 = np.column_stack([v1, v2, v3])

rank_12  = np.linalg.matrix_rank(A12)
rank_123 = np.linalg.matrix_rank(A123)

print("Матриця з v1, v2 як стовпців:")
print(A12)
print(f"rank([v1, v2]) = {rank_12}")

print("Матриця з v1, v2, v3 як стовпців:")
print(A123)
print(f"rank([v1, v2, v3]) = {rank_123}")

if rank_123 == rank_12:
    print("\Висновок (п.1): v3 можна подати як лінійну комбінацію v1 і v2.")
    print("Тобто v3 ∈ span(v1, v2).")

    # 2) Інтерпретація підпростору
    if rank_12 == 2:
        print("Висновок (п.2): v1 і v2 породжують площину (2D підпростір) у R^3.")
        print("Додавання v3 не розширює підпростір: він вже лежить на цій площині (вектор надлишковий).")
    elif rank_12 == 1:
        print("Висновок (п.2): v1 і v2 колінеарні, породжують пряму (1D підпростір).")
        print("v3 теж лежить на цій прямій, тож підпростір не змінюється.")
else:
    print("Висновок (п.1): v3 НЕ можна подати як лінійну комбінацію v1 і v2.")
    print("Тобто v3 ∉ span(v1, v2).")
    print("Висновок (п.2): додавання v3 розширює підпростір (збільшує його розмірність).")


