# Пример вычисления векторного произведения, которое в NumPy 
# выполняется функцией np.cross() и используется 
# для нахождения вектора, ортогонального до двух заданных.

import numpy as np

# Вектори
u = np.array([2, 3, 4])
v = np.array([5, 6, 7])

# Через NumPy
w = np.cross(u, v)

print(f"Вектор u: {u}")
print(f"Вектор v: {v}")
print(f"Векторний добуток (NumPy): {w}")

# Перевірка ортогональності
print(f"Ортогональність:")
print(f"  u · (u×v) = {u @ w}")
print(f"  v · (u×v) = {v @ w}")


# Вектор u: [2 3 4]
# Вектор v: [5 6 7]

# Векторний добуток (NumPy): [-3  6 -3]

# Ортогональність:
#   u · (u×v) = 0
#   v · (u×v) = 0
