# Компанія виробляє продукти А і Б. 
# Для виробництва одиниці продукту А потрібно 5 годин на машині №1 та 3 години на машині №2. 
# Для продукту Б — 2 години на машині №1 та 2 години на машині №2. 
# Максимально доступний час роботи машини №1 — 80 годин, а машини №2 — 40 годин. 
# Прибуток від продажу одиниці продукту А становить $50, а від продукту Б — $40.

# Задача — максимізувати загальний прибуток компанії, 
# вибравши оптимальну кількість продуктів А і Б для виробництва, враховуючи обмеження ресурсів. 
# А також те, що ми фізично не маємо права виготовляти продукту Б більше, ніж 10 одиниць за раз.


import pulp

# Ініціалізація моделі
model = pulp.LpProblem("Maximize Profit", pulp.LpMaximize)

# Визначення змінних
A = pulp.LpVariable('A', lowBound=0, cat='Integer')  # Кількість продукту А
B = pulp.LpVariable('B', lowBound=0, upBound=10, cat='Integer')  # Кількість продукту Б

# Функція цілі (Максимізація прибутку)
model += 50 * A + 40 * B, "Profit"

# Додавання обмежень
model += 5 * A + 2 * B <= 80  # Обмеження для машини №1
model += 3 * A + 2 * B <= 40  # Обмеження для машини №2

# Розв'язання моделі
model.solve()

# Вивід результатів
print("Виробляти продуктів А:", A.varValue)
print("Виробляти продуктів Б:", B.varValue)





# Розглянутий нами приклад чудово ілюструє ключові кроки розв'язку задачі лінійного програмування з використанням бібліотеки PuLP:

# 1. Формулювання задачі: Встановлення задачі лінійного програмування з чіткою цільовою функцією (максимізація прибутку) та визначення обмежень.

# model = pulp.LpProblem("Maximize-Profit", pulp.LpMaximize)


# 2. Визначення змінних: Створення змінних, які представляють кількості продуктів для виробництва, 
# з урахуванням їхніх меж (наприклад, невід'ємність, максимальні обмеження).

# A = pulp.LpVariable('A', lowBound=0, cat='Integer')  # Кількість продукту А
# B = pulp.LpVariable('B', lowBound=0, upBound=10, cat='Integer')  # Кількість продукту Б



# 3. Додавання цільової функції та обмежень: 
# Визначення економічного сенсу задачі через цільову функцію та реалістичні обмеження, що імітують умови виробництва.
# Функція цілі (Максимізація прибутку)

# model += 50 * A + 40 * B, "Profit"

# # Додавання обмежень
# model += 5 * A + 2 * B <= 80  # Обмеження для машини №1
# model += 3 * A + 2 * B <= 40  # Обмеження для машини №2


# 4. Розв'язання задачі: Використання вбудованого вирішувача для знаходження оптимального розв'язку.

# model.solve()


# 5. Аналіз результатів: Інтерпретація результатів, отриманих після розв'язання задачі, для виробничого планування.

# print("Виробляти продуктів А:", A.varValue)
# print("Виробляти продуктів Б:", B.varValue)


# Цей приклад є типовим для промислових застосувань лінійного програмування та може бути адаптований 
# для різних сценаріїв оптимізації в бізнесі та інженерії, 
# демонструючи гнучкість і потужність PuLP як інструмента для оптимізації.